{"config": {"layers": [{"config": {"trainable": true, "batch_input_shape": [null, 216, 1], "activation": "linear", "filters": 256, "padding": "same", "dilation_rate": [1], "activity_regularizer": null, "strides": [1], "kernel_size": [5], "dtype": "float32", "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv1d_1", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv1D"}, {"config": {"trainable": true, "activation": "relu", "dtype": "float32", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"trainable": true, "kernel_constraint": null, "activation": "linear", "filters": 128, "padding": "same", "dilation_rate": [1], "activity_regularizer": null, "strides": [1], "kernel_size": [5], "dtype": "float32", "use_bias": true, "bias_constraint": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv1d_2", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv1D"}, {"config": {"trainable": true, "activation": "relu", "dtype": "float32", "name": "activation_2"}, "class_name": "Activation"}, {"config": {"trainable": true, "rate": 0.1, "dtype": "float32", "seed": null, "noise_shape": null, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "padding": "valid", "strides": [8], "dtype": "float32", "pool_size": [8], "data_format": "channels_last", "name": "max_pooling1d_1"}, "class_name": "MaxPooling1D"}, {"config": {"trainable": true, "kernel_constraint": null, "activation": "linear", "filters": 128, "padding": "same", "dilation_rate": [1], "activity_regularizer": null, "strides": [1], "kernel_size": [5], "dtype": "float32", "use_bias": true, "bias_constraint": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv1d_3", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv1D"}, {"config": {"trainable": true, "activation": "relu", "dtype": "float32", "name": "activation_3"}, "class_name": "Activation"}, {"config": {"trainable": true, "kernel_constraint": null, "activation": "linear", "filters": 128, "padding": "same", "dilation_rate": [1], "activity_regularizer": null, "strides": [1], "kernel_size": [5], "dtype": "float32", "use_bias": true, "bias_constraint": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv1d_4", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv1D"}, {"config": {"trainable": true, "activation": "relu", "dtype": "float32", "name": "activation_4"}, "class_name": "Activation"}, {"config": {"trainable": true, "data_format": "channels_last", "dtype": "float32", "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "kernel_constraint": null, "activation": "linear", "bias_regularizer": null, "activity_regularizer": null, "dtype": "float32", "use_bias": true, "bias_constraint": null, "units": 10, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_1", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "softmax", "dtype": "float32", "name": "activation_5"}, "class_name": "Activation"}], "name": "sequential_1"}, "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.3.0"}